Revit 2026 API

# ConduitSizeIteratorGetCurrent Method

---

Returns the current ConduitSize.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConduitSize GetCurrent()
```
```vb
Public Function GetCurrent As ConduitSize
```
```cpp
public:
ConduitSize^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> ConduitSize
```

#### Return Value

ConduitSize The current ConduitSize.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

ConduitSizeIterator Class

Autodesk.Revit.DB.Electrical Namespace